sparkfun/Pioneer_IoT_Kit_Shield/Firmware/XBee_WiFi/XBee_WiFi.cydsn/Generated_Source/PSoC6/pdl/devices/psoc6/psoc6ble/common/iar/startup/startup_psoc6ble_cm4.s
        PUBWEAK tcpwm_1_interrupts_19_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_1_interrupts_19_IRQHandler
        B tcpwm_1_interrupts_19_IRQHandler

        PUBWEAK tcpwm_1_interrupts_20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_1_interrupts_20_IRQHandler
        B tcpwm_1_interrupts_20_IRQHandler

        PUBWEAK tcpwm_1_interrupts_21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_1_interrupts_21_IRQHandler
        B tcpwm_1_interrupts_21_IRQHandler

        PUBWEAK tcpwm_1_interrupts_22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_1_interrupts_22_IRQHandler
        B tcpwm_1_interrupts_22_IRQHandler

        PUBWEAK tcpwm_1_interrupts_23_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_1_interrupts_23_IRQHandler
        B tcpwm_1_interrupts_23_IRQHandler

        PUBWEAK udb_interrupts_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_0_IRQHandler
        B udb_interrupts_0_IRQHandler

        PUBWEAK udb_interrupts_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_1_IRQHandler
        B udb_interrupts_1_IRQHandler

        PUBWEAK udb_interrupts_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_2_IRQHandler
        B udb_interrupts_2_IRQHandler

        PUBWEAK udb_interrupts_3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_3_IRQHandler
        B udb_interrupts_3_IRQHandler

        PUBWEAK udb_interrupts_4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_4_IRQHandler
        B udb_interrupts_4_IRQHandler

        PUBWEAK udb_interrupts_5_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_5_IRQHandler
        B udb_interrupts_5_IRQHandler

        PUBWEAK udb_interrupts_6_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_6_IRQHandler
        B udb_interrupts_6_IRQHandler

        PUBWEAK udb_interrupts_7_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_7_IRQHandler
        B udb_interrupts_7_IRQHandler

        PUBWEAK udb_interrupts_8_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_8_IRQHandler
        B udb_interrupts_8_IRQHandler

        PUBWEAK udb_interrupts_9_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_9_IRQHandler
        B udb_interrupts_9_IRQHandler

        PUBWEAK udb_interrupts_10_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_10_IRQHandler
        B udb_interrupts_10_IRQHandler

        PUBWEAK udb_interrupts_11_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_11_IRQHandler
        B udb_interrupts_11_IRQHandler

        PUBWEAK udb_interrupts_12_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_12_IRQHandler
        B udb_interrupts_12_IRQHandler

        PUBWEAK udb_interrupts_13_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_13_IRQHandler
        B udb_interrupts_13_IRQHandler

        PUBWEAK udb_interrupts_14_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_14_IRQHandler
        B udb_interrupts_14_IRQHandler

        PUBWEAK udb_interrupts_15_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
udb_interrupts_15_IRQHandler
        B udb_interrupts_15_IRQHandler

        PUBWEAK pass_interrupt_sar_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
pass_interrupt_sar_IRQHandler
        B pass_interrupt_sar_IRQHandler

        PUBWEAK audioss_interrupt_i2s_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
audioss_interrupt_i2s_IRQHandler
        B audioss_interrupt_i2s_IRQHandler

        PUBWEAK audioss_interrupt_pdm_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
audioss_interrupt_pdm_IRQHandler
        B audioss_interrupt_pdm_IRQHandler

        PUBWEAK profile_interrupt_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
profile_interrupt_IRQHandler
        B profile_interrupt_IRQHandler

        PUBWEAK smif_interrupt_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
smif_interrupt_IRQHandler
        B smif_interrupt_IRQHandler

        PUBWEAK usb_interrupt_hi_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
usb_interrupt_hi_IRQHandler
        B usb_interrupt_hi_IRQHandler

        PUBWEAK usb_interrupt_med_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
usb_interrupt_med_IRQHandler
        B usb_interrupt_med_IRQHandler

        PUBWEAK usb_interrupt_lo_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
usb_interrupt_lo_IRQHandler
        B usb_interrupt_lo_IRQHandler

        PUBWEAK pass_interrupt_dacs_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
pass_interrupt_dacs_IRQHandler
        B pass_interrupt_dacs_IRQHandler

        END

